validation-seabed-scouring-by-square-jet/testcase-deformationJet2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 -0.05) //0
    (10 0 -0.05)  //1
    (10 0.05 -0.05) //2
    (0 0.05 -0.05) //3
    (0 0  0.05)   //4
    (10 0  0.05)  //5
    (10 0.05  0.05) //6
    (0 0.05  0.05) //7
    
    (10 0.15 -0.05) //8
    (0 0.15 -0.05) //9
    (10 0.15  0.05) //10
    (0 0.15  0.05) //11
    
    (10 0.6 -0.05) //12
    (0 0.6 -0.05) //13
    (10 0.6 0.05) //14
    (0 0.6 0.05) //15
    
    (-0.01 0 -0.05) //16
    (-0.01 0 0.05) //17
    (-0.01 0.05  -0.05) //18
    (-0.01 0.05  0.05) //19
    (-0.01 0.15  -0.05) //20
    (-0.01 0.15  0.05) //21
    (-0.01 0.6  -0.05) //22
    (-0.01 0.6  0.05) //23
);

blocks
(
    hex (0  1  2  3 4 5  6  7) (400 8 1) simpleGrading (2 1 1)
    hex (3  2  8  9 7 6 10 11) (400 15 1) simpleGrading (2 1 1)
    hex (9 8 12 13 11 10 14 15) (400 40 1) simpleGrading (2 3 1)
    
    hex (16 0 3 18 17 4 7 19) (1 8 1) simpleGrading (0.8 1 1)
    hex (20 9 13 22 21 11 15 23) (1 40 1) simpleGrading (0.8 3 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (16 17 19 18)
            (20 21 23 22)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (3 7 11 9)
        );
    }
    side1
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (7 6 10 11)
            (11 10 14 15)
            (17 4 7 19)
            (21 11 15 23)
        );
    }
    
    side2
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (3 2 8 9)
            (9 8 12 13)
            (16 0 3 18)
            (20 9 13 22)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 5 6 2)
            (2 6 10 8)
            (8 10 14 12)
        );
    }
    top
    {
        type patch;
        faces
        (
            (13 12 14 15)
            (22 23 15 13)
        );
    }
    down
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (16 0 4 17)
        );
    }
    
    wallSop
    {
        type wall;
        faces
        (
            (18 3 7 19)
            (20 9 11 21)
        );
    }
);

// ************************************************************************* //
