validation-seabed-scouring-by-square-jet/testcase-deformationJet2D/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(inlet|right)"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    "(left)"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
    
    top
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
    
    "(side|nozzle|wallSop)"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
    
    down
    {
        type            timeVaryingMappedFixedValue;
        outOfBounds     clamp;
    }
}

// ************************************************************************* //
