validation-seabed-scouring-by-square-jet/testcase-deformationJet2D/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform 0.118214;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    side1
    {
        type            empty;
    }
    side2
    {
        type            empty;
    }
    right
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    down
    {
        type            calculated;
        value           uniform 0.118214;
    }
    wallSop
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
